tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "universal-ctags/universal-ctags"
brew "ack"
brew "autojump"
brew "bash"
brew "bash-completion"
brew "coreutils"
brew "dark-mode"
brew "dos2unix"
brew "fd"
brew "findutils"
brew "fish"
brew "node"
brew "fx"
brew "fzf"
brew "gawk"
brew "gifski"
brew "git"
brew "gnu-sed"
brew "graphviz"
brew "grep"
brew "haskell-stack"
brew "jq"
brew "leiningen"
brew "moreutils"
brew "mpv"
brew "ncdu"
brew "p7zip"
brew "python"
brew "pwgen"
brew "ranger"
brew "readline"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "speedtest-cli"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "trash"
brew "vim", link: false
brew "wakeonlan"
brew "watch"
brew "watchman"
brew "wget"
brew "xz"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"
brew "d12frosted/emacs-plus/emacs-plus"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "adobe-acrobat-reader"
cask "appcleaner"
cask "bettertouchtool"
cask "calibre"
cask "coconutbattery"
cask "docker"
cask "dotnet-sdk"
cask "gog-galaxy"
cask "handbrake"
cask "imageoptim"
cask "inkscape"
cask "intellij-idea-ce"
cask "iterm2"
cask "java"
cask "keepassxc"
cask "keka"
cask "keycastr"
cask "libreoffice"
cask "macvim"
cask "macs-fan-control"
cask "meld"
cask "microsoft-teams"
cask "mono-mdk-for-visual-studio"
cask "namebench"
cask "nightowl"
cask "osxfuse"
cask "racket"
cask "parsec"
cask "postman"
cask "scroll-reverser"
cask "scummvm"
cask "send-to-kindle"
cask "slack"
cask "spectacle"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "toggl"
cask "tomighty"
cask "transmission"
cask "veracrypt"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "yacreader"
cask "zotero"
