tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "markwu/personal"
brew "youtube-dl"
brew "bash"
brew "ffmpeg"
brew "bash-completion"
brew "emacs-plus"
brew "fortune"
brew "git"
brew "libarchive"
brew "macvim"
brew "node"
brew "perl"
brew "uncrustify"
brew "qt"
brew "rakudo-star"
brew "surfraw"
brew "zeal", args: ['HEAD']
brew "zsh"
cask "appcleaner"
cask "bettertouchtool"
cask "brave-browser"
cask "calibre"
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-hasklig"
cask "font-ibm-plex"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-sans-condensed"
cask "font-ibm-plex-serif"
cask "gog-galaxy"
cask "handbrake"
cask "homebrew/cask-fonts/font-iosevka"
cask "homebrew/cask-fonts/font-iosevka-aile"
cask "homebrew/cask-fonts/font-iosevka-etoile"
cask "homebrew/cask-fonts/font-iosevka-slab"
cask "homebrew/cask-fonts/font-iosevka-sparkle"
cask "homebrew/cask/scummvm"
cask "imageoptim"
cask "intellij-idea-ce"
cask "iterm2"
cask "java"
cask "jetbrains-toolbox"
cask "keepassxc"
cask "keka"
cask "kitty"
cask "libreoffice"
cask "macs-fan-control"
cask "microsoft-teams"
cask "openemu"
cask "osxfuse"
cask "parsec"
cask "parsec"
cask "postman"
cask "racket"
cask "scroll-reverser"
cask "spectacle"
cask "spotify"
cask "steam"
cask "toggl"
cask "transmission"
cask "veracrypt"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "xquartz"
cask "yacreader"
cask "zotero"
cask "mono-mdk"
cask "dotnet-sdk"
cask "docker"
cask "azure-data-studio"
cask "unity-hub"
cask "dropbox"
cask "amethyst"
cask "mpv"
