# Install with brew bundle --global --verbose
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "markwu/personal"

brew "mitmproxy"
brew "direnv"

# From nix
brew "ack"
brew "autojump"
brew "coreutils"
brew "curl"
brew "delta"
brew "dos2unix"
brew "docker"
brew "docker-machine"
brew "entr"
brew "fd"
brew "findutils"
brew "fish"
brew "fzf"
brew "gawk"
brew "git-extras"
brew "git-open"
brew "git-quick-stats"
brew "grep"
brew "gnu-sed"
brew "graphviz"
brew "gron"
brew "highlight"
brew "htop"
brew "jq"
brew "leiningen"
brew "moreutils"
brew "ncdu"
brew "p7zip"
brew "pandoc"
brew "pwgen"
brew "ranger"
brew "readline"
brew "ripgrep"
brew "rlwrap"
brew "shellcheck"
brew "shfmt"
brew "the_silver_searcher"
brew "speedtest-cli"
brew "tig"
brew "tldr"
brew "tmux"
brew "trash-cli"
brew "tree"
brew "ctags"
brew "up"
brew "w3m"
brew "watch"
brew "watchman"
brew "wget"

# Fun
brew "cmatrix"
brew "cowsay"
brew "figlet"
brew "fortune"
brew "gti"
brew "lolcat"
brew "nyancat"
brew "sl"
brew "thefuck"

brew "bash"
brew "bash-completion"
brew "ffmpeg"
brew "git"
brew "gpg"
brew "java"
brew "node"
brew "perl"
brew "youtube-dl"
brew "zsh"
cask "alfred"
cask "appcleaner"
cask "azure-data-studio"
cask "bettertouchtool"
cask "brave-browser"
cask "calibre"
cask "dotnet-sdk"
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-hasklig"
cask "font-ibm-plex"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-sans-condensed"
cask "font-ibm-plex-serif"
cask "gog-galaxy"
cask "google-chrome"
cask "handbrake"
cask "homebrew/cask-fonts/font-iosevka"
cask "homebrew/cask-fonts/font-iosevka-aile"
cask "homebrew/cask-fonts/font-iosevka-etoile"
cask "homebrew/cask-fonts/font-iosevka-slab"
cask "homebrew/cask-fonts/font-iosevka-sparkle"
cask "homebrew/cask/scummvm"
cask "imageoptim"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keepassxc"
cask "keka"
cask "kitty"
cask "libreoffice"
cask "macs-fan-control"
cask "macvim"
cask "microsoft-teams"
cask "mono-mdk-for-visual-studio"
cask "openemu"
cask "osxfuse"
cask "parsec"
cask "rectangle"
cask "scroll-reverser"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "toggl-track"
cask "transmission"
cask "veracrypt"
cask "virtualbox"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "xquartz"
cask "yacreader"
cask "zotero"
cask "apppolice"

