# Install with brew bundle --file '[path]' --verbose --force
# tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask-versions"
# tap "markwu/personal"

brew "bash"
brew "bash-completion"
brew "zsh"
brew "zsh-completions"
brew "coreutils"
# brew "emacs-plus"
brew "findutils"
brew "fish"
brew "git"
brew "grep"
# brew "java"
brew "tmux"
# brew "node"
# brew "yarn"
brew "reattach-to-user-namespace"

brew "ack"
brew "bat"
brew "curl"
brew "direnv"
brew "dos2unix"
brew "entr"
brew "fd"
brew "findutils"
brew "fx"
brew "fzf"
brew "gawk"
brew "git"
brew "git-delta"
brew "git-extras"
brew "gnupg2"
brew "graphviz"
brew "grep"
brew "gsed"
brew "gron"
brew "highlight"
brew "htop"
brew "jq"
brew "imagemagick"
brew "leiningen"
brew "moreutils"
brew "ncdu"
brew "p7zip"
brew "pandoc"
brew "perl"
brew "pwgen"
brew "python3"
brew "ranger"
brew "readline"
brew "ripgrep"
brew "rlwrap"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "speedtest-cli"
brew "stack"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "universal-ctags"
brew "up"
brew "w3m"
brew "watch"
brew "watchman"
brew "wget"
brew "neovim", args: ["HEAD"]

# cask "alacritty"
# cask "font-cascadia-code"
# cask "font-fira-code"
# cask "font-hasklig"
# cask "font-ibm-plex"
# cask "font-ibm-plex-mono"
# cask "font-ibm-plex-sans"
# cask "font-ibm-plex-sans-condensed"
# cask "font-ibm-plex-serif"
# cask "homebrew/cask-fonts/font-iosevka"
# cask "homebrew/cask-fonts/font-iosevka-aile"
# cask "homebrew/cask-fonts/font-iosevka-etoile"
# cask "homebrew/cask-fonts/font-iosevka-slab"
# cask "homebrew/cask-fonts/font-iosevka-sparkle"
# cask "jetbrains-toolbox"
# cask "macs-fan-control"
# cask "osxfuse"
# cask "scroll-reverser"
# cask "sublime-text"
# cask "virtualbox"
cask "adobe-acrobat-reader"
cask "alfred"
cask "appcleaner"
cask "apppolice"
cask "azure-data-studio"
cask "bartender"
cask "bettertouchtool"
cask "boop"
cask "calibre"
cask "cryptomator"
cask "docker"
cask "dotnet-sdk"
cask "dropbox"
cask "gog-galaxy"
cask "handbrake"
cask "homebrew/cask/scummvm"
cask "imageoptim"
cask "inkscape"
cask "insomnia"
cask "intellij-idea-ce"
cask "iterm2"
cask "keka"
cask "kitty"
cask "libreoffice"
cask "macvim"
cask "microsoft-azure-storage-explorer"
cask "microsoft-teams"
cask "parsec"
cask "postman"
cask "rectangle"
cask "spotify"
cask "steam"
cask "transmission"
cask "veracrypt"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "xquartz"
cask "yacreader"
cask "zotero"
cask "qlvideo"
